Revit 2027 API
SpecTypeId.ElectricalTemperature Property
 Temperature, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElectricalTemperature { get; }
Public Shared ReadOnly Property ElectricalTemperature As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElectricalTemperature {
	ForgeTypeId^ get ();
}
static member ElectricalTemperature : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace